БПКР/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>DefinedType.КурсВалюты</types>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БПКР/src/InformationRegisters/КурсыВалют/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Процедура - Заполнить по умолчанию
// Выполняет первоночальное заполнение
Процедура ЗаполнитьПоУмолчанию() Экспорт 
	СправочникМенеджер = Справочники.Валюты;
	
	КлассификаторXML = РегистрыСведений.КурсыВалют.ПолучитьМакет("МакетЗаполнения").ПолучитьТекст();
	КлассификаторТаблица = ОбщегоНазначения.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные;
	
	НаборЗаписей = РегистрыСведений.КурсыВалют.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();                 
	
	Для Каждого СтрокаТаблицыЗначений Из КлассификаторТаблица Цикл
		Период = Дата(СокрЛП(СтрокаТаблицыЗначений.Период));
		Курс   = Число(СокрЛП(СтрокаТаблицыЗначений.Курс));
		Валюта = СправочникМенеджер.НайтиПоКоду(СокрЛП(СтрокаТаблицыЗначений.Валюта));
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Валюта = Валюта;
		НоваяЗапись.Период = Период;
		НоваяЗапись.Курс   = Курс;
		НоваяЗапись.Кратность = 1;
	КонецЦикла;
	
	Попытка
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	Исключение
	КонецПопытки;
КонецПроцедуры // ЗаполнитьПоУмолчанию()	

#КонецОбласти

#КонецЕсли
